backend/app/controllers/admin/task_progress_reports_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?, ?)  [["id", 3], ["id", 2], ["id", 1]]
SELECT "task_progress_reports".* FROM "task_progress_reports" ORDER BY "task_progress_reports"."collected_at" DESC LIMIT ?  [["LIMIT", 10]]
---
    def index
      reports = ::TaskProgressReport
                  .includes(:user)
                  .order(collected_at: :desc)
                  .limit(10)

      render json: reports.map { |report|