backend/lib/tasks/task_progress.rake

  task report: :environment do
    puts "== タスク進捗レポート =="

    User.find_each do |user|
      tasks = user.assigned_tasks
      total = tasks.count
      done = tasks.where(status: 'done').count
      rate = total > 0 ? (done.to_f / total * 100).round(1) : 0.0

      TaskProgressReport.create!(
        user_id: user.id,
        total_tasks: total,
        done_tasks: done,
        progress_rate: rate,
        collected_at: Time.current
      )
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1000]]
INSERT INTO "task_progress_reports" ("user_id", "total_tasks", "done_tasks", "progress_rate", "collected_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"