backend/app/controllers/tasks_controller.rb

SELECT "workspaces".* FROM "workspaces" INNER JOIN "user_workspaces" ON "workspaces"."id" = "user_workspaces"."workspace_id" WHERE "user_workspaces"."user_id" = ? AND "workspaces"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."workspace_id" = ? AND "tasks"."status" = ?  [["workspace_id", 1], ["status", "done"]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."workspace_id" = ? AND "tasks"."status" = ? AND "tasks"."assigned_user_id" = ?  [["workspace_id", 1], ["status", "in_progress"], ["assigned_user_id", 1]]
---
  def index
  workspace = @current_user.workspaces.find_by(id: params[:workspace_id])

  if workspace
    tasks = workspace.tasks

    tasks = tasks.where(status: params[:status]) if params[:status].present?
    tasks = tasks.where(assigned_user_id: params[:assigned_user_id]) if params[:assigned_user_id].present?
    tasks = tasks.where(category: params[:category]) if params[:category].present?

UPDATE "tasks" SET "title" = ?, "status" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "보고서 수정"], ["status", "in_progress"], ["updated_at", "2025-05-11 08:11:59.701057"], ["id", 1]]
INSERT INTO "tasks" ("title", "description", "status", "category", "workspace_id", "created_at", "updated_at", "assigned_user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
    task = Task.new(task_params)
    task.workspace_id = params[:workspace_id]

    if task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? AND "tasks"."workspace_id" = ? LIMIT ?  [["id", 10], ["workspace_id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "설수현12345454"], ["updated_at", "2025-05-12 07:59:08.560954"], ["id", 10]]
---
  task = Task.find_by(id: params[:id], workspace_id: params[:workspace_id])

  if task
    if task.update(task_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? AND "tasks"."workspace_id" = ? LIMIT ?  [["id", 9], ["workspace_id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 9]]
---
  task = Task.find_by(id: params[:id], workspace_id: params[:workspace_id])

  if task
    task.destroy

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? AND "tasks"."workspace_id" = ? LIMIT ?  [["id", 4], ["workspace_id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["status", "done"], ["updated_at", "2025-05-12 07:41:32.350873"], ["id", 4]]
---
  task = Task.find_by(id: params[:id], workspace_id: params[:workspace_id])

  if task
    task.status = task.status == "done" ? "todo" : "done"
    if task.save