backend/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "김개발"], ["email", "dev@example.com"], ["password_digest", "[FILTERED]"], ["created_at", "2025-05-11 02:10:14.751780"], ["updated_at", "2025-05-11 02:10:14.751780"]]
---
  def create
    user = User.new(user_params)
    if user.save