backend/app/controllers/workspaces_controller.rb

INSERT INTO "user_workspaces" ("user_id", "workspace_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["user_id", 1], ["workspace_id", 1], ["created_at", "2025-05-11 06:02:03.662861"], ["updated_at", "2025-05-11 06:02:03.662861"]]
INSERT INTO "workspaces" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "개발팀"], ["created_at", "2025-05-11 06:02:03.623393"], ["updated_at", "2025-05-11 06:02:03.623393"]]
---
  def create
    workspace = Workspace.new(workspace_params)
    if workspace.save
      UserWorkspace.create(user: @current_user, workspace: workspace)